---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectShape
source: html/12ae45fe-e79f-573a-bf55-7c851591b770.htm
---
# DirectShape Members

Adds the externally tagged geometry object to the DirectShape.